---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.Longitude
source: html/7c6ce169-ddda-00f3-9560-ef719bec0a2a.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.Longitude Property

Identifies the current longitude used by the SunAndShadowSettings element.

## Syntax (C#)
```csharp
public double Longitude { get; }
```